# =============================================================================
# Brewfile — Homebrew 패키지 선언
# Usage: brew bundle --file=Brewfile
# =============================================================================

# --- Core CLI Tools ---
brew "asdf"           # 런타임 버전 관리
brew "coreutils"      # GNU 핵심 유틸리티
brew "eza"            # ls 대체 (아이콘, Git 상태)
brew "gh"             # GitHub CLI
brew "gnupg"          # GPG 암호화
brew "lazygit"        # Git TUI
brew "zplug"          # Zsh 플러그인 매니저

# --- Utilities ---
brew "imagemagick"    # 이미지 처리
brew "mole"           # macOS 시스템 정리/최적화

# --- Cloud ---
brew "azure-cli"
# brew "awscli"
# brew "gcloud-sdk"

# --- AI CLI Tools (선택 — 필요 없으면 주석 처리) ---
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"
cask "claude-code"
cask "codex"
brew "gemini-cli"

# --- Fonts ---
cask "font-d2coding-nerd-font"
cask "font-sarasa-gothic"

# --- Apps ---
cask "visual-studio-code"
cask "ghostty"
