# =============================================================================
# Brewfile — Homebrew 패키지 선언
# Usage: brew bundle --file=Brewfile
# =============================================================================

# --- Taps ---
tap "anomalyco/tap"

# --- Core CLI Tools ---
brew "asdf"           # 런타임 버전 관리
brew "coreutils"      # GNU 핵심 유틸리티
brew "eza"            # ls 대체 (아이콘, Git 상태)
brew "gawk"           # GNU awk
brew "gh"             # GitHub CLI
brew "gnupg"          # GPG 암호화
brew "imagemagick"    # 이미지 처리
brew "lazygit"        # Git TUI
brew "mole"           # SSH 터널링
brew "pandoc"         # 문서 변환
brew "zplug"          # Zsh 플러그인 매니저

# --- Azure ---
brew "azure-cli"

# --- AI CLI Tools (선택 설치 — 필요한 항목만 주석 해제) ---
# brew "gemini-cli"
# brew "anomalyco/tap/opencode"
# cask "claude-code"
# cask "codex"

# --- Fonts ---
cask "font-d2coding-nerd-font"
cask "font-sarasa-gothic"

# --- Apps ---
cask "visual-studio-code"
cask "ghostty"
